      
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.vercel_project_directory.directory: Reading...[0m[0m
[0m[1mdata.vercel_project_directory.directory: Read complete after 0s [id=../../../doppelgengar.dev][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # vercel_deployment.deployment[0m will be created
[0m  [32m+[0m[0m resource "vercel_deployment" "deployment" {
      [32m+[0m[0m domains     = (known after apply)
      [32m+[0m[0m files       = {
          [32m+[0m[0m "../../../doppelgengar.dev/.eslintrc.json"      = "40~75e677e7192205173354ae9375c1d25ef78b0cec"
          [32m+[0m[0m "../../../doppelgengar.dev/README.md"           = "1383~7186f4406725e6e20e302dd4d649698b641e8e3b"
          [32m+[0m[0m "../../../doppelgengar.dev/next.config.mjs"     = "92~d242b535f61738790c7f8ca71ab7e6f31f8e66ca"
          [32m+[0m[0m "../../../doppelgengar.dev/package-lock.json"   = "173775~1a535819b5c0694070f7599f478a85762ae47a10"
          [32m+[0m[0m "../../../doppelgengar.dev/package.json"        = "557~6be0f5552b5595f77d389aa0afe4fede0fad7058"
          [32m+[0m[0m "../../../doppelgengar.dev/postcss.config.js"   = "83~81781ed39dc8e6d6521ae1d63a67e46894acc2eb"
          [32m+[0m[0m "../../../doppelgengar.dev/public/next.svg"     = "1375~3f3e95622612b989c5bd6a03299a308c6f3c7e6b"
          [32m+[0m[0m "../../../doppelgengar.dev/public/vercel.svg"   = "629~38fefd5276208736eb9d43ecd50cee08bf56fbcd"
          [32m+[0m[0m "../../../doppelgengar.dev/src/app/favicon.ico" = "25931~9ecfcc8f0ead0bf3d2d7c39e084b88f41cc89a2e"
          [32m+[0m[0m "../../../doppelgengar.dev/src/app/globals.css" = "606~9974e75019d9652a45ed97cb336d2ea713665bba"
          [32m+[0m[0m "../../../doppelgengar.dev/src/app/layout.tsx"  = "473~dd6dc5356919c823d496f7fb687bde54e870fc04"
          [32m+[0m[0m "../../../doppelgengar.dev/src/app/page.tsx"    = "5843~219388ec3a203f245e8047ee6cedaa4419d5a78a"
          [32m+[0m[0m "../../../doppelgengar.dev/tailwind.config.ts"  = "510~77c873fbb737425e5572f16ce9bc07b281b4b94c"
          [32m+[0m[0m "../../../doppelgengar.dev/tsconfig.json"       = "578~71beb4ab458ca43ab89af60332005d5eeb310700"
        }
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m path_prefix = "../../../doppelgengar.dev"
      [32m+[0m[0m production  = true
      [32m+[0m[0m project_id  = (known after apply)
      [32m+[0m[0m team_id     = (known after apply)
      [32m+[0m[0m url         = (known after apply)
    }

[1m  # vercel_project.portfolio[0m will be created
[0m  [32m+[0m[0m resource "vercel_project" "portfolio" {
      [32m+[0m[0m framework                               = "nextjs"
      [32m+[0m[0m id                                      = (known after apply)
      [32m+[0m[0m name                                    = "doppelgengar-portfolio"
      [32m+[0m[0m protection_bypass_for_automation_secret = (known after apply)
      [32m+[0m[0m serverless_function_region              = (known after apply)
      [32m+[0m[0m team_id                                 = (known after apply)
      [32m+[0m[0m vercel_authentication                   = {
          [32m+[0m[0m protect_production = false
        }
    }

[1m  # vercel_project_domain.apex[0m will be created
[0m  [32m+[0m[0m resource "vercel_project_domain" "apex" {
      [32m+[0m[0m domain     = "doppelgengar.dev"
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m project_id = (known after apply)
      [32m+[0m[0m team_id    = (known after apply)
    }

[1m  # vercel_project_domain.www[0m will be created
[0m  [32m+[0m[0m resource "vercel_project_domain" "www" {
      [32m+[0m[0m domain     = "www.doppelgengar.dev"
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m project_id = (known after apply)
      [32m+[0m[0m team_id    = (known after apply)
    }

[1mPlan:[0m 4 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @DoppelG3ngar, Action: `pull_request`, Working Directory: `./terraform/environments/staging`, Workflow: `Pull request from feature branch`*